baseCase_v3/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../modelParms"

defaultFieldValues
(
    volVectorFieldValue U (0 0 0)
);

regions
(
    sphereToCell
    {
        origin (0 $dropHeight 0);
        radius  $dropVelocityRadius;

        fieldValues
        (
            //Initial droplet velocity
            volVectorFieldValue U (0 $dropVelocity 0)
        );
    }
);


// ************************************************************************* //
